MikroElektronika/core_packages/PIC/XC8/def/PIC18F6393/mcu.h
extern volatile LCDDATA8bits_t LCDDATA8bits __at(0xF68);
// bitfield macros
#define _LCDDATA8_LCDDATA8_POSN                             0x0
#define _LCDDATA8_LCDDATA8_POSITION                         0x0
#define _LCDDATA8_LCDDATA8_SIZE                             0x8
#define _LCDDATA8_LCDDATA8_LENGTH                           0x8
#define _LCDDATA8_LCDDATA8_MASK                             0xFF
#define _LCDDATA8_S16C1_POSN                                0x0
#define _LCDDATA8_S16C1_POSITION                            0x0
#define _LCDDATA8_S16C1_SIZE                                0x1
#define _LCDDATA8_S16C1_LENGTH                              0x1
#define _LCDDATA8_S16C1_MASK                                0x1
#define _LCDDATA8_S17C1_POSN                                0x1
#define _LCDDATA8_S17C1_POSITION                            0x1
#define _LCDDATA8_S17C1_SIZE                                0x1
#define _LCDDATA8_S17C1_LENGTH                              0x1
#define _LCDDATA8_S17C1_MASK                                0x2
#define _LCDDATA8_S18C1_POSN                                0x2
#define _LCDDATA8_S18C1_POSITION                            0x2
#define _LCDDATA8_S18C1_SIZE                                0x1
#define _LCDDATA8_S18C1_LENGTH                              0x1
#define _LCDDATA8_S18C1_MASK                                0x4
#define _LCDDATA8_S19C1_POSN                                0x3
#define _LCDDATA8_S19C1_POSITION                            0x3
#define _LCDDATA8_S19C1_SIZE                                0x1
#define _LCDDATA8_S19C1_LENGTH                              0x1
#define _LCDDATA8_S19C1_MASK                                0x8
#define _LCDDATA8_S20C1_POSN                                0x4
#define _LCDDATA8_S20C1_POSITION                            0x4
#define _LCDDATA8_S20C1_SIZE                                0x1
#define _LCDDATA8_S20C1_LENGTH                              0x1
#define _LCDDATA8_S20C1_MASK                                0x10
#define _LCDDATA8_S21C1_POSN                                0x5
#define _LCDDATA8_S21C1_POSITION                            0x5
#define _LCDDATA8_S21C1_SIZE                                0x1
#define _LCDDATA8_S21C1_LENGTH                              0x1
#define _LCDDATA8_S21C1_MASK                                0x20
#define _LCDDATA8_S22C1_POSN                                0x6
#define _LCDDATA8_S22C1_POSITION                            0x6
#define _LCDDATA8_S22C1_SIZE                                0x1
#define _LCDDATA8_S22C1_LENGTH                              0x1
#define _LCDDATA8_S22C1_MASK                                0x40
#define _LCDDATA8_S23C1_POSN                                0x7
#define _LCDDATA8_S23C1_POSITION                            0x7
#define _LCDDATA8_S23C1_SIZE                                0x1
#define _LCDDATA8_S23C1_LENGTH                              0x1
#define _LCDDATA8_S23C1_MASK                                0x80
#define _LCDDATA8_SEG16COM1_POSN                            0x0
#define _LCDDATA8_SEG16COM1_POSITION                        0x0
#define _LCDDATA8_SEG16COM1_SIZE                            0x1
#define _LCDDATA8_SEG16COM1_LENGTH                          0x1
#define _LCDDATA8_SEG16COM1_MASK                            0x1
#define _LCDDATA8_SEG17COM1_POSN                            0x1
#define _LCDDATA8_SEG17COM1_POSITION                        0x1
#define _LCDDATA8_SEG17COM1_SIZE                            0x1
#define _LCDDATA8_SEG17COM1_LENGTH                          0x1
#define _LCDDATA8_SEG17COM1_MASK                            0x2
#define _LCDDATA8_SEG18COM1_POSN                            0x2
#define _LCDDATA8_SEG18COM1_POSITION                        0x2
#define _LCDDATA8_SEG18COM1_SIZE                            0x1
#define _LCDDATA8_SEG18COM1_LENGTH                          0x1
#define _LCDDATA8_SEG18COM1_MASK                            0x4
#define _LCDDATA8_SEG19COM1_POSN                            0x3
#define _LCDDATA8_SEG19COM1_POSITION                        0x3
#define _LCDDATA8_SEG19COM1_SIZE                            0x1
#define _LCDDATA8_SEG19COM1_LENGTH                          0x1
#define _LCDDATA8_SEG19COM1_MASK                            0x8
#define _LCDDATA8_SEG20COM1_POSN                            0x4
#define _LCDDATA8_SEG20COM1_POSITION                        0x4
#define _LCDDATA8_SEG20COM1_SIZE                            0x1
#define _LCDDATA8_SEG20COM1_LENGTH                          0x1
#define _LCDDATA8_SEG20COM1_MASK                            0x10
#define _LCDDATA8_SEG21COM1_POSN                            0x5
#define _LCDDATA8_SEG21COM1_POSITION                        0x5
#define _LCDDATA8_SEG21COM1_SIZE                            0x1
#define _LCDDATA8_SEG21COM1_LENGTH                          0x1
#define _LCDDATA8_SEG21COM1_MASK                            0x20
#define _LCDDATA8_SEG22COM1_POSN                            0x6
#define _LCDDATA8_SEG22COM1_POSITION                        0x6
#define _LCDDATA8_SEG22COM1_SIZE                            0x1
#define _LCDDATA8_SEG22COM1_LENGTH                          0x1
#define _LCDDATA8_SEG22COM1_MASK                            0x40
#define _LCDDATA8_SEG23COM1_POSN                            0x7
#define _LCDDATA8_SEG23COM1_POSITION                        0x7
#define _LCDDATA8_SEG23COM1_SIZE                            0x1
#define _LCDDATA8_SEG23COM1_LENGTH                          0x1
#define _LCDDATA8_SEG23COM1_MASK                            0x80

// Register: LCDDATA9
#define LCDDATA9 LCDDATA9
extern volatile unsigned char           LCDDATA9            __at(0xF69);
#ifndef _LIB_BUILD
asm("LCDDATA9 equ 0F69h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA9               :8;
    };
    struct {
        unsigned S24C1                  :1;
        unsigned S25C1                  :1;
        unsigned S26C1                  :1;
        unsigned S27C1                  :1;
        unsigned S28C1                  :1;
        unsigned S29C1                  :1;
        unsigned S30C1                  :1;
        unsigned S31C1                  :1;
    };
    struct {
        unsigned SEG24COM1              :1;
        unsigned SEG25COM1              :1;
        unsigned SEG26COM1              :1;
        unsigned SEG27COM1              :1;
        unsigned SEG28COM1              :1;
        unsigned SEG29COM1              :1;
        unsigned SEG30COM1              :1;
        unsigned SEG31COM1              :1;
    };
} LCDDATA9bits_t;
extern volatile LCDDATA9bits_t LCDDATA9bits __at(0xF69);
// bitfield macros
#define _LCDDATA9_LCDDATA9_POSN                             0x0
#define _LCDDATA9_LCDDATA9_POSITION                         0x0
#define _LCDDATA9_LCDDATA9_SIZE                             0x8
#define _LCDDATA9_LCDDATA9_LENGTH                           0x8
#define _LCDDATA9_LCDDATA9_MASK                             0xFF
#define _LCDDATA9_S24C1_POSN                                0x0
#define _LCDDATA9_S24C1_POSITION                            0x0
#define _LCDDATA9_S24C1_SIZE                                0x1
#define _LCDDATA9_S24C1_LENGTH                              0x1
#define _LCDDATA9_S24C1_MASK                                0x1
#define _LCDDATA9_S25C1_POSN                                0x1
#define _LCDDATA9_S25C1_POSITION                            0x1
#define _LCDDATA9_S25C1_SIZE                                0x1
#define _LCDDATA9_S25C1_LENGTH                              0x1
#define _LCDDATA9_S25C1_MASK                                0x2
#define _LCDDATA9_S26C1_POSN                                0x2
#define _LCDDATA9_S26C1_POSITION                            0x2
#define _LCDDATA9_S26C1_SIZE                                0x1
#define _LCDDATA9_S26C1_LENGTH                              0x1
#define _LCDDATA9_S26C1_MASK                                0x4
#define _LCDDATA9_S27C1_POSN                                0x3
#define _LCDDATA9_S27C1_POSITION                            0x3
#define _LCDDATA9_S27C1_SIZE                                0x1
#define _LCDDATA9_S27C1_LENGTH                              0x1
#define _LCDDATA9_S27C1_MASK                                0x8
#define _LCDDATA9_S28C1_POSN                                0x4
#define _LCDDATA9_S28C1_POSITION                            0x4
#define _LCDDATA9_S28C1_SIZE                                0x1
#define _LCDDATA9_S28C1_LENGTH                              0x1
#define _LCDDATA9_S28C1_MASK                                0x10
#define _LCDDATA9_S29C1_POSN                                0x5
#define _LCDDATA9_S29C1_POSITION                            0x5
#define _LCDDATA9_S29C1_SIZE                                0x1
#define _LCDDATA9_S29C1_LENGTH                              0x1
#define _LCDDATA9_S29C1_MASK                                0x20
#define _LCDDATA9_S30C1_POSN                                0x6
#define _LCDDATA9_S30C1_POSITION                            0x6
#define _LCDDATA9_S30C1_SIZE                                0x1
#define _LCDDATA9_S30C1_LENGTH                              0x1
#define _LCDDATA9_S30C1_MASK                                0x40
#define _LCDDATA9_S31C1_POSN                                0x7
#define _LCDDATA9_S31C1_POSITION                            0x7
#define _LCDDATA9_S31C1_SIZE                                0x1
#define _LCDDATA9_S31C1_LENGTH                              0x1
#define _LCDDATA9_S31C1_MASK                                0x80
#define _LCDDATA9_SEG24COM1_POSN                            0x0
#define _LCDDATA9_SEG24COM1_POSITION                        0x0
#define _LCDDATA9_SEG24COM1_SIZE                            0x1
#define _LCDDATA9_SEG24COM1_LENGTH                          0x1
#define _LCDDATA9_SEG24COM1_MASK                            0x1
#define _LCDDATA9_SEG25COM1_POSN                            0x1
#define _LCDDATA9_SEG25COM1_POSITION                        0x1
#define _LCDDATA9_SEG25COM1_SIZE                            0x1
#define _LCDDATA9_SEG25COM1_LENGTH                          0x1
#define _LCDDATA9_SEG25COM1_MASK                            0x2
#define _LCDDATA9_SEG26COM1_POSN                            0x2
#define _LCDDATA9_SEG26COM1_POSITION                        0x2
#define _LCDDATA9_SEG26COM1_SIZE                            0x1
#define _LCDDATA9_SEG26COM1_LENGTH                          0x1
#define _LCDDATA9_SEG26COM1_MASK                            0x4
#define _LCDDATA9_SEG27COM1_POSN                            0x3
#define _LCDDATA9_SEG27COM1_POSITION                        0x3
#define _LCDDATA9_SEG27COM1_SIZE                            0x1
#define _LCDDATA9_SEG27COM1_LENGTH                          0x1
#define _LCDDATA9_SEG27COM1_MASK                            0x8
#define _LCDDATA9_SEG28COM1_POSN                            0x4
#define _LCDDATA9_SEG28COM1_POSITION                        0x4
#define _LCDDATA9_SEG28COM1_SIZE                            0x1
#define _LCDDATA9_SEG28COM1_LENGTH                          0x1
#define _LCDDATA9_SEG28COM1_MASK                            0x10
#define _LCDDATA9_SEG29COM1_POSN                            0x5
#define _LCDDATA9_SEG29COM1_POSITION                        0x5
#define _LCDDATA9_SEG29COM1_SIZE                            0x1
#define _LCDDATA9_SEG29COM1_LENGTH                          0x1
#define _LCDDATA9_SEG29COM1_MASK                            0x20
#define _LCDDATA9_SEG30COM1_POSN                            0x6
#define _LCDDATA9_SEG30COM1_POSITION                        0x6
#define _LCDDATA9_SEG30COM1_SIZE                            0x1
#define _LCDDATA9_SEG30COM1_LENGTH                          0x1
#define _LCDDATA9_SEG30COM1_MASK                            0x40
#define _LCDDATA9_SEG31COM1_POSN                            0x7
#define _LCDDATA9_SEG31COM1_POSITION                        0x7
#define _LCDDATA9_SEG31COM1_SIZE                            0x1
#define _LCDDATA9_SEG31COM1_LENGTH                          0x1
#define _LCDDATA9_SEG31COM1_MASK                            0x80

// Register: LCDDATA10
#define LCDDATA10 LCDDATA10
extern volatile unsigned char           LCDDATA10           __at(0xF6A);
#ifndef _LIB_BUILD
asm("LCDDATA10 equ 0F6Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA10              :8;
    };
    struct {
        unsigned S32C1                  :1;
        unsigned S33C1                  :1;
        unsigned S34C1                  :1;
        unsigned S35C1                  :1;
        unsigned S36C1                  :1;
        unsigned S37C1                  :1;
        unsigned S38C1                  :1;
        unsigned S39C1                  :1;
    };
    struct {
        unsigned SEG32COM1              :1;
        unsigned SEG33COM1              :1;
        unsigned SEG34COM1              :1;
        unsigned SEG35COM1              :1;
        unsigned SEG36COM1              :1;
        unsigned SEG37COM1              :1;
        unsigned SEG38COM1              :1;
        unsigned SEG39COM1              :1;
    };
} LCDDATA10bits_t;
extern volatile LCDDATA10bits_t LCDDATA10bits __at(0xF6A);
// bitfield macros
#define _LCDDATA10_LCDDATA10_POSN                           0x0
#define _LCDDATA10_LCDDATA10_POSITION                       0x0
#define _LCDDATA10_LCDDATA10_SIZE                           0x8
#define _LCDDATA10_LCDDATA10_LENGTH                         0x8
#define _LCDDATA10_LCDDATA10_MASK                           0xFF
#define _LCDDATA10_S32C1_POSN                               0x0
#define _LCDDATA10_S32C1_POSITION                           0x0
#define _LCDDATA10_S32C1_SIZE                               0x1
#define _LCDDATA10_S32C1_LENGTH                             0x1
#define _LCDDATA10_S32C1_MASK                               0x1
#define _LCDDATA10_S33C1_POSN                               0x1
#define _LCDDATA10_S33C1_POSITION                           0x1
#define _LCDDATA10_S33C1_SIZE                               0x1
#define _LCDDATA10_S33C1_LENGTH                             0x1
#define _LCDDATA10_S33C1_MASK                               0x2
#define _LCDDATA10_S34C1_POSN                               0x2
#define _LCDDATA10_S34C1_POSITION                           0x2
#define _LCDDATA10_S34C1_SIZE                               0x1
#define _LCDDATA10_S34C1_LENGTH                             0x1
#define _LCDDATA10_S34C1_MASK                               0x4
#define _LCDDATA10_S35C1_POSN                               0x3
#define _LCDDATA10_S35C1_POSITION                           0x3
#define _LCDDATA10_S35C1_SIZE                               0x1
#define _LCDDATA10_S35C1_LENGTH                             0x1
#define _LCDDATA10_S35C1_MASK                               0x8
#define _LCDDATA10_S36C1_POSN                               0x4
#define _LCDDATA10_S36C1_POSITION                           0x4
#define _LCDDATA10_S36C1_SIZE                               0x1
#define _LCDDATA10_S36C1_LENGTH                             0x1
#define _LCDDATA10_S36C1_MASK                               0x10
#define _LCDDATA10_S37C1_POSN                               0x5
#define _LCDDATA10_S37C1_POSITION                           0x5
#define _LCDDATA10_S37C1_SIZE                               0x1
#define _LCDDATA10_S37C1_LENGTH                             0x1
#define _LCDDATA10_S37C1_MASK                               0x20
#define _LCDDATA10_S38C1_POSN                               0x6
#define _LCDDATA10_S38C1_POSITION                           0x6
#define _LCDDATA10_S38C1_SIZE                               0x1
#define _LCDDATA10_S38C1_LENGTH                             0x1
#define _LCDDATA10_S38C1_MASK                               0x40
#define _LCDDATA10_S39C1_POSN                               0x7
#define _LCDDATA10_S39C1_POSITION                           0x7
#define _LCDDATA10_S39C1_SIZE                               0x1
#define _LCDDATA10_S39C1_LENGTH                             0x1
#define _LCDDATA10_S39C1_MASK                               0x80
#define _LCDDATA10_SEG32COM1_POSN                           0x0
#define _LCDDATA10_SEG32COM1_POSITION                       0x0
#define _LCDDATA10_SEG32COM1_SIZE                           0x1
#define _LCDDATA10_SEG32COM1_LENGTH                         0x1
#define _LCDDATA10_SEG32COM1_MASK                           0x1
#define _LCDDATA10_SEG33COM1_POSN                           0x1
#define _LCDDATA10_SEG33COM1_POSITION                       0x1
#define _LCDDATA10_SEG33COM1_SIZE                           0x1
#define _LCDDATA10_SEG33COM1_LENGTH                         0x1
#define _LCDDATA10_SEG33COM1_MASK                           0x2
#define _LCDDATA10_SEG34COM1_POSN                           0x2
#define _LCDDATA10_SEG34COM1_POSITION                       0x2
#define _LCDDATA10_SEG34COM1_SIZE                           0x1
#define _LCDDATA10_SEG34COM1_LENGTH                         0x1
#define _LCDDATA10_SEG34COM1_MASK                           0x4
#define _LCDDATA10_SEG35COM1_POSN                           0x3
#define _LCDDATA10_SEG35COM1_POSITION                       0x3
#define _LCDDATA10_SEG35COM1_SIZE                           0x1
#define _LCDDATA10_SEG35COM1_LENGTH                         0x1
#define _LCDDATA10_SEG35COM1_MASK                           0x8
#define _LCDDATA10_SEG36COM1_POSN                           0x4
#define _LCDDATA10_SEG36COM1_POSITION                       0x4
#define _LCDDATA10_SEG36COM1_SIZE                           0x1
#define _LCDDATA10_SEG36COM1_LENGTH                         0x1
#define _LCDDATA10_SEG36COM1_MASK                           0x10
#define _LCDDATA10_SEG37COM1_POSN                           0x5
#define _LCDDATA10_SEG37COM1_POSITION                       0x5
#define _LCDDATA10_SEG37COM1_SIZE                           0x1
#define _LCDDATA10_SEG37COM1_LENGTH                         0x1
#define _LCDDATA10_SEG37COM1_MASK                           0x20
#define _LCDDATA10_SEG38COM1_POSN                           0x6
#define _LCDDATA10_SEG38COM1_POSITION                       0x6
#define _LCDDATA10_SEG38COM1_SIZE                           0x1
#define _LCDDATA10_SEG38COM1_LENGTH                         0x1
#define _LCDDATA10_SEG38COM1_MASK                           0x40
#define _LCDDATA10_SEG39COM1_POSN                           0x7
#define _LCDDATA10_SEG39COM1_POSITION                       0x7
#define _LCDDATA10_SEG39COM1_SIZE                           0x1
#define _LCDDATA10_SEG39COM1_LENGTH                         0x1
#define _LCDDATA10_SEG39COM1_MASK                           0x80

// Register: RCSTA2
#define RCSTA2 RCSTA2
extern volatile unsigned char           RCSTA2              __at(0xF6B);
#ifndef _LIB_BUILD
asm("RCSTA2 equ 0F6Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RX9D                   :1;
        unsigned OERR                   :1;
        unsigned FERR                   :1;
        unsigned ADDEN                  :1;
        unsigned CREN                   :1;
        unsigned SREN                   :1;
        unsigned RX9                    :1;
        unsigned SPEN                   :1;
    };
    struct {
        unsigned RCD8                   :1;
        unsigned                        :2;
        unsigned ADEN                   :1;
        unsigned                        :2;
        unsigned RC9                    :1;
    };
    struct {
        unsigned                        :6;
        unsigned NOT_RC8                :1;
    };
    struct {
        unsigned                        :6;
        unsigned nRC8                   :1;
    };
    struct {
        unsigned                        :6;
        unsigned RC8_9                  :1;
    };
    struct {
        unsigned RX9D2                  :1;
        unsigned OERR2                  :1;
        unsigned FERR2                  :1;
        unsigned ADDEN2                 :1;
        unsigned CREN2                  :1;
        unsigned SREN2                  :1;
        unsigned RX92                   :1;
        unsigned SPEN2                  :1;
    };
    struct {
        unsigned RCD82                  :1;
        unsigned                        :5;
        unsigned RC8_92                 :1;
    };
    struct {
        unsigned                        :6;
        unsigned RC92                   :1;
    };
} RCSTA2bits_t;
