MikroElektronika/core_packages/PIC/XC8/def/PIC18F6393/mcu.h
extern volatile LCDDATA18bits_t LCDDATA18bits __at(0xF77);
// bitfield macros
#define _LCDDATA18_LCDDATA18_POSN                           0x0
#define _LCDDATA18_LCDDATA18_POSITION                       0x0
#define _LCDDATA18_LCDDATA18_SIZE                           0x8
#define _LCDDATA18_LCDDATA18_LENGTH                         0x8
#define _LCDDATA18_LCDDATA18_MASK                           0xFF
#define _LCDDATA18_S0C3_POSN                                0x0
#define _LCDDATA18_S0C3_POSITION                            0x0
#define _LCDDATA18_S0C3_SIZE                                0x1
#define _LCDDATA18_S0C3_LENGTH                              0x1
#define _LCDDATA18_S0C3_MASK                                0x1
#define _LCDDATA18_S1C3_POSN                                0x1
#define _LCDDATA18_S1C3_POSITION                            0x1
#define _LCDDATA18_S1C3_SIZE                                0x1
#define _LCDDATA18_S1C3_LENGTH                              0x1
#define _LCDDATA18_S1C3_MASK                                0x2
#define _LCDDATA18_S2C3_POSN                                0x2
#define _LCDDATA18_S2C3_POSITION                            0x2
#define _LCDDATA18_S2C3_SIZE                                0x1
#define _LCDDATA18_S2C3_LENGTH                              0x1
#define _LCDDATA18_S2C3_MASK                                0x4
#define _LCDDATA18_S3C3_POSN                                0x3
#define _LCDDATA18_S3C3_POSITION                            0x3
#define _LCDDATA18_S3C3_SIZE                                0x1
#define _LCDDATA18_S3C3_LENGTH                              0x1
#define _LCDDATA18_S3C3_MASK                                0x8
#define _LCDDATA18_S4C3_POSN                                0x4
#define _LCDDATA18_S4C3_POSITION                            0x4
#define _LCDDATA18_S4C3_SIZE                                0x1
#define _LCDDATA18_S4C3_LENGTH                              0x1
#define _LCDDATA18_S4C3_MASK                                0x10
#define _LCDDATA18_S5C3_POSN                                0x5
#define _LCDDATA18_S5C3_POSITION                            0x5
#define _LCDDATA18_S5C3_SIZE                                0x1
#define _LCDDATA18_S5C3_LENGTH                              0x1
#define _LCDDATA18_S5C3_MASK                                0x20
#define _LCDDATA18_S6C3_POSN                                0x6
#define _LCDDATA18_S6C3_POSITION                            0x6
#define _LCDDATA18_S6C3_SIZE                                0x1
#define _LCDDATA18_S6C3_LENGTH                              0x1
#define _LCDDATA18_S6C3_MASK                                0x40
#define _LCDDATA18_S7C3_POSN                                0x7
#define _LCDDATA18_S7C3_POSITION                            0x7
#define _LCDDATA18_S7C3_SIZE                                0x1
#define _LCDDATA18_S7C3_LENGTH                              0x1
#define _LCDDATA18_S7C3_MASK                                0x80
#define _LCDDATA18_SEG0COM3_POSN                            0x0
#define _LCDDATA18_SEG0COM3_POSITION                        0x0
#define _LCDDATA18_SEG0COM3_SIZE                            0x1
#define _LCDDATA18_SEG0COM3_LENGTH                          0x1
#define _LCDDATA18_SEG0COM3_MASK                            0x1
#define _LCDDATA18_SEG1COM3_POSN                            0x1
#define _LCDDATA18_SEG1COM3_POSITION                        0x1
#define _LCDDATA18_SEG1COM3_SIZE                            0x1
#define _LCDDATA18_SEG1COM3_LENGTH                          0x1
#define _LCDDATA18_SEG1COM3_MASK                            0x2
#define _LCDDATA18_SEG2COM3_POSN                            0x2
#define _LCDDATA18_SEG2COM3_POSITION                        0x2
#define _LCDDATA18_SEG2COM3_SIZE                            0x1
#define _LCDDATA18_SEG2COM3_LENGTH                          0x1
#define _LCDDATA18_SEG2COM3_MASK                            0x4
#define _LCDDATA18_SEG3COM3_POSN                            0x3
#define _LCDDATA18_SEG3COM3_POSITION                        0x3
#define _LCDDATA18_SEG3COM3_SIZE                            0x1
#define _LCDDATA18_SEG3COM3_LENGTH                          0x1
#define _LCDDATA18_SEG3COM3_MASK                            0x8
#define _LCDDATA18_SEG4COM3_POSN                            0x4
#define _LCDDATA18_SEG4COM3_POSITION                        0x4
#define _LCDDATA18_SEG4COM3_SIZE                            0x1
#define _LCDDATA18_SEG4COM3_LENGTH                          0x1
#define _LCDDATA18_SEG4COM3_MASK                            0x10
#define _LCDDATA18_SEG5COM3_POSN                            0x5
#define _LCDDATA18_SEG5COM3_POSITION                        0x5
#define _LCDDATA18_SEG5COM3_SIZE                            0x1
#define _LCDDATA18_SEG5COM3_LENGTH                          0x1
#define _LCDDATA18_SEG5COM3_MASK                            0x20
#define _LCDDATA18_SEG6COM3_POSN                            0x6
#define _LCDDATA18_SEG6COM3_POSITION                        0x6
#define _LCDDATA18_SEG6COM3_SIZE                            0x1
#define _LCDDATA18_SEG6COM3_LENGTH                          0x1
#define _LCDDATA18_SEG6COM3_MASK                            0x40
#define _LCDDATA18_SEG7COM3_POSN                            0x7
#define _LCDDATA18_SEG7COM3_POSITION                        0x7
#define _LCDDATA18_SEG7COM3_SIZE                            0x1
#define _LCDDATA18_SEG7COM3_LENGTH                          0x1
#define _LCDDATA18_SEG7COM3_MASK                            0x80
#define _LCDDATA18_S00C3_POSN                               0x0
#define _LCDDATA18_S00C3_POSITION                           0x0
#define _LCDDATA18_S00C3_SIZE                               0x1
#define _LCDDATA18_S00C3_LENGTH                             0x1
#define _LCDDATA18_S00C3_MASK                               0x1
#define _LCDDATA18_S01C3_POSN                               0x1
#define _LCDDATA18_S01C3_POSITION                           0x1
#define _LCDDATA18_S01C3_SIZE                               0x1
#define _LCDDATA18_S01C3_LENGTH                             0x1
#define _LCDDATA18_S01C3_MASK                               0x2
#define _LCDDATA18_S02C3_POSN                               0x2
#define _LCDDATA18_S02C3_POSITION                           0x2
#define _LCDDATA18_S02C3_SIZE                               0x1
#define _LCDDATA18_S02C3_LENGTH                             0x1
#define _LCDDATA18_S02C3_MASK                               0x4
#define _LCDDATA18_S03C3_POSN                               0x3
#define _LCDDATA18_S03C3_POSITION                           0x3
#define _LCDDATA18_S03C3_SIZE                               0x1
#define _LCDDATA18_S03C3_LENGTH                             0x1
#define _LCDDATA18_S03C3_MASK                               0x8
#define _LCDDATA18_S04C3_POSN                               0x4
#define _LCDDATA18_S04C3_POSITION                           0x4
#define _LCDDATA18_S04C3_SIZE                               0x1
#define _LCDDATA18_S04C3_LENGTH                             0x1
#define _LCDDATA18_S04C3_MASK                               0x10
#define _LCDDATA18_S05C3_POSN                               0x5
#define _LCDDATA18_S05C3_POSITION                           0x5
#define _LCDDATA18_S05C3_SIZE                               0x1
#define _LCDDATA18_S05C3_LENGTH                             0x1
#define _LCDDATA18_S05C3_MASK                               0x20
#define _LCDDATA18_S06C3_POSN                               0x6
#define _LCDDATA18_S06C3_POSITION                           0x6
#define _LCDDATA18_S06C3_SIZE                               0x1
#define _LCDDATA18_S06C3_LENGTH                             0x1
#define _LCDDATA18_S06C3_MASK                               0x40
#define _LCDDATA18_S07C3_POSN                               0x7
#define _LCDDATA18_S07C3_POSITION                           0x7
#define _LCDDATA18_S07C3_SIZE                               0x1
#define _LCDDATA18_S07C3_LENGTH                             0x1
#define _LCDDATA18_S07C3_MASK                               0x80

// Register: LCDDATA19
#define LCDDATA19 LCDDATA19
extern volatile unsigned char           LCDDATA19           __at(0xF78);
#ifndef _LIB_BUILD
asm("LCDDATA19 equ 0F78h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA19              :8;
    };
    struct {
        unsigned S8C3                   :1;
        unsigned S9C3                   :1;
        unsigned S10C3                  :1;
        unsigned S11C3                  :1;
        unsigned S12C3                  :1;
        unsigned S13C3                  :1;
        unsigned S14C3                  :1;
        unsigned S15C3                  :1;
    };
    struct {
        unsigned SEG8COM3               :1;
        unsigned SEG9COM3               :1;
        unsigned SEG10COM3              :1;
        unsigned SEG11COM3              :1;
        unsigned SEG12COM3              :1;
        unsigned SEG13COM3              :1;
        unsigned SEG14COM3              :1;
        unsigned SEG15COM3              :1;
    };
    struct {
        unsigned S08C3                  :1;
        unsigned S09C3                  :1;
    };
    struct {
        unsigned                        :4;
        unsigned T3CKPS019              :1;
        unsigned T3CKPS119              :1;
        unsigned TMR3CS019              :1;
        unsigned TMR3CS119              :1;
    };
} LCDDATA19bits_t;
extern volatile LCDDATA19bits_t LCDDATA19bits __at(0xF78);
// bitfield macros
#define _LCDDATA19_LCDDATA19_POSN                           0x0
#define _LCDDATA19_LCDDATA19_POSITION                       0x0
#define _LCDDATA19_LCDDATA19_SIZE                           0x8
#define _LCDDATA19_LCDDATA19_LENGTH                         0x8
#define _LCDDATA19_LCDDATA19_MASK                           0xFF
#define _LCDDATA19_S8C3_POSN                                0x0
#define _LCDDATA19_S8C3_POSITION                            0x0
#define _LCDDATA19_S8C3_SIZE                                0x1
#define _LCDDATA19_S8C3_LENGTH                              0x1
#define _LCDDATA19_S8C3_MASK                                0x1
#define _LCDDATA19_S9C3_POSN                                0x1
#define _LCDDATA19_S9C3_POSITION                            0x1
#define _LCDDATA19_S9C3_SIZE                                0x1
#define _LCDDATA19_S9C3_LENGTH                              0x1
#define _LCDDATA19_S9C3_MASK                                0x2
#define _LCDDATA19_S10C3_POSN                               0x2
#define _LCDDATA19_S10C3_POSITION                           0x2
#define _LCDDATA19_S10C3_SIZE                               0x1
#define _LCDDATA19_S10C3_LENGTH                             0x1
#define _LCDDATA19_S10C3_MASK                               0x4
#define _LCDDATA19_S11C3_POSN                               0x3
#define _LCDDATA19_S11C3_POSITION                           0x3
#define _LCDDATA19_S11C3_SIZE                               0x1
#define _LCDDATA19_S11C3_LENGTH                             0x1
#define _LCDDATA19_S11C3_MASK                               0x8
#define _LCDDATA19_S12C3_POSN                               0x4
#define _LCDDATA19_S12C3_POSITION                           0x4
#define _LCDDATA19_S12C3_SIZE                               0x1
#define _LCDDATA19_S12C3_LENGTH                             0x1
#define _LCDDATA19_S12C3_MASK                               0x10
#define _LCDDATA19_S13C3_POSN                               0x5
#define _LCDDATA19_S13C3_POSITION                           0x5
#define _LCDDATA19_S13C3_SIZE                               0x1
#define _LCDDATA19_S13C3_LENGTH                             0x1
#define _LCDDATA19_S13C3_MASK                               0x20
#define _LCDDATA19_S14C3_POSN                               0x6
#define _LCDDATA19_S14C3_POSITION                           0x6
#define _LCDDATA19_S14C3_SIZE                               0x1
#define _LCDDATA19_S14C3_LENGTH                             0x1
#define _LCDDATA19_S14C3_MASK                               0x40
#define _LCDDATA19_S15C3_POSN                               0x7
#define _LCDDATA19_S15C3_POSITION                           0x7
#define _LCDDATA19_S15C3_SIZE                               0x1
#define _LCDDATA19_S15C3_LENGTH                             0x1
#define _LCDDATA19_S15C3_MASK                               0x80
#define _LCDDATA19_SEG8COM3_POSN                            0x0
#define _LCDDATA19_SEG8COM3_POSITION                        0x0
#define _LCDDATA19_SEG8COM3_SIZE                            0x1
#define _LCDDATA19_SEG8COM3_LENGTH                          0x1
#define _LCDDATA19_SEG8COM3_MASK                            0x1
#define _LCDDATA19_SEG9COM3_POSN                            0x1
#define _LCDDATA19_SEG9COM3_POSITION                        0x1
#define _LCDDATA19_SEG9COM3_SIZE                            0x1
#define _LCDDATA19_SEG9COM3_LENGTH                          0x1
#define _LCDDATA19_SEG9COM3_MASK                            0x2
#define _LCDDATA19_SEG10COM3_POSN                           0x2
#define _LCDDATA19_SEG10COM3_POSITION                       0x2
#define _LCDDATA19_SEG10COM3_SIZE                           0x1
#define _LCDDATA19_SEG10COM3_LENGTH                         0x1
#define _LCDDATA19_SEG10COM3_MASK                           0x4
#define _LCDDATA19_SEG11COM3_POSN                           0x3
#define _LCDDATA19_SEG11COM3_POSITION                       0x3
#define _LCDDATA19_SEG11COM3_SIZE                           0x1
#define _LCDDATA19_SEG11COM3_LENGTH                         0x1
#define _LCDDATA19_SEG11COM3_MASK                           0x8
#define _LCDDATA19_SEG12COM3_POSN                           0x4
#define _LCDDATA19_SEG12COM3_POSITION                       0x4
#define _LCDDATA19_SEG12COM3_SIZE                           0x1
#define _LCDDATA19_SEG12COM3_LENGTH                         0x1
#define _LCDDATA19_SEG12COM3_MASK                           0x10
#define _LCDDATA19_SEG13COM3_POSN                           0x5
#define _LCDDATA19_SEG13COM3_POSITION                       0x5
#define _LCDDATA19_SEG13COM3_SIZE                           0x1
#define _LCDDATA19_SEG13COM3_LENGTH                         0x1
#define _LCDDATA19_SEG13COM3_MASK                           0x20
#define _LCDDATA19_SEG14COM3_POSN                           0x6
#define _LCDDATA19_SEG14COM3_POSITION                       0x6
#define _LCDDATA19_SEG14COM3_SIZE                           0x1
#define _LCDDATA19_SEG14COM3_LENGTH                         0x1
#define _LCDDATA19_SEG14COM3_MASK                           0x40
#define _LCDDATA19_SEG15COM3_POSN                           0x7
#define _LCDDATA19_SEG15COM3_POSITION                       0x7
#define _LCDDATA19_SEG15COM3_SIZE                           0x1
#define _LCDDATA19_SEG15COM3_LENGTH                         0x1
#define _LCDDATA19_SEG15COM3_MASK                           0x80
#define _LCDDATA19_S08C3_POSN                               0x0
#define _LCDDATA19_S08C3_POSITION                           0x0
#define _LCDDATA19_S08C3_SIZE                               0x1
#define _LCDDATA19_S08C3_LENGTH                             0x1
#define _LCDDATA19_S08C3_MASK                               0x1
#define _LCDDATA19_S09C3_POSN                               0x1
#define _LCDDATA19_S09C3_POSITION                           0x1
#define _LCDDATA19_S09C3_SIZE                               0x1
#define _LCDDATA19_S09C3_LENGTH                             0x1
#define _LCDDATA19_S09C3_MASK                               0x2
#define _LCDDATA19_T3CKPS019_POSN                           0x4
#define _LCDDATA19_T3CKPS019_POSITION                       0x4
#define _LCDDATA19_T3CKPS019_SIZE                           0x1
#define _LCDDATA19_T3CKPS019_LENGTH                         0x1
#define _LCDDATA19_T3CKPS019_MASK                           0x10
#define _LCDDATA19_T3CKPS119_POSN                           0x5
#define _LCDDATA19_T3CKPS119_POSITION                       0x5
#define _LCDDATA19_T3CKPS119_SIZE                           0x1
#define _LCDDATA19_T3CKPS119_LENGTH                         0x1
#define _LCDDATA19_T3CKPS119_MASK                           0x20
#define _LCDDATA19_TMR3CS019_POSN                           0x6
#define _LCDDATA19_TMR3CS019_POSITION                       0x6
#define _LCDDATA19_TMR3CS019_SIZE                           0x1
#define _LCDDATA19_TMR3CS019_LENGTH                         0x1
#define _LCDDATA19_TMR3CS019_MASK                           0x40
#define _LCDDATA19_TMR3CS119_POSN                           0x7
#define _LCDDATA19_TMR3CS119_POSITION                       0x7
#define _LCDDATA19_TMR3CS119_SIZE                           0x1
#define _LCDDATA19_TMR3CS119_LENGTH                         0x1
#define _LCDDATA19_TMR3CS119_MASK                           0x80

