MikroElektronika/core_packages/PIC/XC8/def/PIC18F6393/mcu.h
// Register: LCDDATA20
#define LCDDATA20 LCDDATA20
extern volatile unsigned char           LCDDATA20           __at(0xF79);
#ifndef _LIB_BUILD
asm("LCDDATA20 equ 0F79h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA20              :8;
    };
    struct {
        unsigned S16C3                  :1;
        unsigned S17C3                  :1;
        unsigned S18C3                  :1;
        unsigned S19C3                  :1;
        unsigned S20C3                  :1;
        unsigned S21C3                  :1;
        unsigned S22C3                  :1;
        unsigned S23C3                  :1;
    };
    struct {
        unsigned SEG16COM3              :1;
        unsigned SEG17COM3              :1;
        unsigned SEG18COM3              :1;
        unsigned SEG19COM3              :1;
        unsigned SEG20COM3              :1;
        unsigned SEG21COM3              :1;
        unsigned SEG22COM3              :1;
        unsigned SEG23COM3              :1;
    };
} LCDDATA20bits_t;
extern volatile LCDDATA20bits_t LCDDATA20bits __at(0xF79);
// bitfield macros
#define _LCDDATA20_LCDDATA20_POSN                           0x0
#define _LCDDATA20_LCDDATA20_POSITION                       0x0
#define _LCDDATA20_LCDDATA20_SIZE                           0x8
#define _LCDDATA20_LCDDATA20_LENGTH                         0x8
#define _LCDDATA20_LCDDATA20_MASK                           0xFF
#define _LCDDATA20_S16C3_POSN                               0x0
#define _LCDDATA20_S16C3_POSITION                           0x0
#define _LCDDATA20_S16C3_SIZE                               0x1
#define _LCDDATA20_S16C3_LENGTH                             0x1
#define _LCDDATA20_S16C3_MASK                               0x1
#define _LCDDATA20_S17C3_POSN                               0x1
#define _LCDDATA20_S17C3_POSITION                           0x1
#define _LCDDATA20_S17C3_SIZE                               0x1
#define _LCDDATA20_S17C3_LENGTH                             0x1
#define _LCDDATA20_S17C3_MASK                               0x2
#define _LCDDATA20_S18C3_POSN                               0x2
#define _LCDDATA20_S18C3_POSITION                           0x2
#define _LCDDATA20_S18C3_SIZE                               0x1
#define _LCDDATA20_S18C3_LENGTH                             0x1
#define _LCDDATA20_S18C3_MASK                               0x4
#define _LCDDATA20_S19C3_POSN                               0x3
#define _LCDDATA20_S19C3_POSITION                           0x3
#define _LCDDATA20_S19C3_SIZE                               0x1
#define _LCDDATA20_S19C3_LENGTH                             0x1
#define _LCDDATA20_S19C3_MASK                               0x8
#define _LCDDATA20_S20C3_POSN                               0x4
#define _LCDDATA20_S20C3_POSITION                           0x4
#define _LCDDATA20_S20C3_SIZE                               0x1
#define _LCDDATA20_S20C3_LENGTH                             0x1
#define _LCDDATA20_S20C3_MASK                               0x10
#define _LCDDATA20_S21C3_POSN                               0x5
#define _LCDDATA20_S21C3_POSITION                           0x5
#define _LCDDATA20_S21C3_SIZE                               0x1
#define _LCDDATA20_S21C3_LENGTH                             0x1
#define _LCDDATA20_S21C3_MASK                               0x20
#define _LCDDATA20_S22C3_POSN                               0x6
#define _LCDDATA20_S22C3_POSITION                           0x6
#define _LCDDATA20_S22C3_SIZE                               0x1
#define _LCDDATA20_S22C3_LENGTH                             0x1
#define _LCDDATA20_S22C3_MASK                               0x40
#define _LCDDATA20_S23C3_POSN                               0x7
#define _LCDDATA20_S23C3_POSITION                           0x7
#define _LCDDATA20_S23C3_SIZE                               0x1
#define _LCDDATA20_S23C3_LENGTH                             0x1
#define _LCDDATA20_S23C3_MASK                               0x80
#define _LCDDATA20_SEG16COM3_POSN                           0x0
#define _LCDDATA20_SEG16COM3_POSITION                       0x0
#define _LCDDATA20_SEG16COM3_SIZE                           0x1
#define _LCDDATA20_SEG16COM3_LENGTH                         0x1
#define _LCDDATA20_SEG16COM3_MASK                           0x1
#define _LCDDATA20_SEG17COM3_POSN                           0x1
#define _LCDDATA20_SEG17COM3_POSITION                       0x1
#define _LCDDATA20_SEG17COM3_SIZE                           0x1
#define _LCDDATA20_SEG17COM3_LENGTH                         0x1
#define _LCDDATA20_SEG17COM3_MASK                           0x2
#define _LCDDATA20_SEG18COM3_POSN                           0x2
#define _LCDDATA20_SEG18COM3_POSITION                       0x2
#define _LCDDATA20_SEG18COM3_SIZE                           0x1
#define _LCDDATA20_SEG18COM3_LENGTH                         0x1
#define _LCDDATA20_SEG18COM3_MASK                           0x4
#define _LCDDATA20_SEG19COM3_POSN                           0x3
#define _LCDDATA20_SEG19COM3_POSITION                       0x3
#define _LCDDATA20_SEG19COM3_SIZE                           0x1
#define _LCDDATA20_SEG19COM3_LENGTH                         0x1
#define _LCDDATA20_SEG19COM3_MASK                           0x8
#define _LCDDATA20_SEG20COM3_POSN                           0x4
#define _LCDDATA20_SEG20COM3_POSITION                       0x4
#define _LCDDATA20_SEG20COM3_SIZE                           0x1
#define _LCDDATA20_SEG20COM3_LENGTH                         0x1
#define _LCDDATA20_SEG20COM3_MASK                           0x10
#define _LCDDATA20_SEG21COM3_POSN                           0x5
#define _LCDDATA20_SEG21COM3_POSITION                       0x5
#define _LCDDATA20_SEG21COM3_SIZE                           0x1
#define _LCDDATA20_SEG21COM3_LENGTH                         0x1
#define _LCDDATA20_SEG21COM3_MASK                           0x20
#define _LCDDATA20_SEG22COM3_POSN                           0x6
#define _LCDDATA20_SEG22COM3_POSITION                       0x6
#define _LCDDATA20_SEG22COM3_SIZE                           0x1
#define _LCDDATA20_SEG22COM3_LENGTH                         0x1
#define _LCDDATA20_SEG22COM3_MASK                           0x40
#define _LCDDATA20_SEG23COM3_POSN                           0x7
#define _LCDDATA20_SEG23COM3_POSITION                       0x7
#define _LCDDATA20_SEG23COM3_SIZE                           0x1
#define _LCDDATA20_SEG23COM3_LENGTH                         0x1
#define _LCDDATA20_SEG23COM3_MASK                           0x80

// Register: LCDDATA21
#define LCDDATA21 LCDDATA21
extern volatile unsigned char           LCDDATA21           __at(0xF7A);
#ifndef _LIB_BUILD
asm("LCDDATA21 equ 0F7Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LCDDATA21              :8;
    };
    struct {
        unsigned S24C3                  :1;
        unsigned S25C3                  :1;
        unsigned S26C3                  :1;
        unsigned S27C3                  :1;
        unsigned S28C3                  :1;
        unsigned S29C3                  :1;
        unsigned S30C3                  :1;
        unsigned S31C3                  :1;
    };
    struct {
        unsigned SEG24COM3              :1;
        unsigned SEG25COM3              :1;
        unsigned SEG26COM3              :1;
        unsigned SEG27COM3              :1;
        unsigned SEG28COM3              :1;
        unsigned SEG29COM3              :1;
        unsigned SEG30COM3              :1;
        unsigned SEG31COM3              :1;
    };
} LCDDATA21bits_t;
